---
kind: enumMember
id: F:Autodesk.Revit.DB.LeaderEndCondition.Attached
enum: Autodesk.Revit.DB.LeaderEndCondition
source: html/c86e3feb-80c8-ab4c-e9cf-18875131b96a.htm
---
# Autodesk.Revit.DB.LeaderEndCondition.Attached

The Leader of the tag is attached.